kafka_benchmark_results_20250924_211445/batch-optimized/producer-test.log
4998 records sent, 999.0 records/sec (0.98 MB/sec), 5.4 ms avg latency, 362.0 ms max latency.
5004 records sent, 1000.6 records/sec (0.98 MB/sec), 4.3 ms avg latency, 8.0 ms max latency.
12000 records sent, 999.417007 records/sec (0.98 MB/sec), 4.77 ms avg latency, 362.00 ms max latency, 5 ms 50th, 7 ms 95th, 16 ms 99th, 28 ms 99.9th.